That issue looks fixed! Thanks. I'm still seeing one unexpected behaviour. I've got three tokens in my sample terraform, and running `terraform apply` with no changes, I see this diff for  one of them. This one has an expiry date, which doesnt change! but the diff thinks it does:

```
Terraform will perform the following actions:

  # grafana_cloud_private_data_source_connect_network_token.test3 must be replaced
-/+ resource "grafana_cloud_private_data_source_connect_network_token" "test3" {
      ~ created_at     = "2025-01-16T10:21:45Z" -> (known after apply)
      ~ expires_at     = "2025-02-01T00:00:00Z" -> "2025-02-01T00:00:00.00Z" # forces replacement
      ~ id             = "prod-gb-south-0:0a466813-3e6d-4e0d-ac09-2c6ba70b7669" -> (known after apply)
        name           = "my-pdc-token-3"
      ~ token          = (sensitive value)
      + updated_at     = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```


I think once we've fixed this one we're good to go.